; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v10 ?v5)
             (pred_10 ?v9 ?v2)
             (pred_11 ?v10 ?v2)
             (pred_6 ?v11 ?v10 )
	     (pred_5 ?v10)
             (pred_1 ?v13)
             (pred_12 ?v9)
             (pred_8 ?v2)
             (pred_3 ?v10)
             (pred_2 ?v9)
             (pred_7 ?v10)
             (pred_4 ))



(:action op_2
:parameters (?v1 ?v8 ?v7 ?v12)
:precondition (and (pred_1 ?v1) (pred_1 ?v8) (pred_12 ?v7) (pred_8 ?v12)
          (pred_9 ?v1 ?v8) (pred_10 ?v7 ?v12)
                   (pred_11 ?v8 ?v12) (pred_5 ?v1) 
                   (pred_3 ?v8) (pred_2 ?v7))
:effect (and  (pred_7 ?v8) (not (pred_3 ?v8))))


(:action op_3
:parameters (?v1 ?v3)
:precondition (and (pred_1 ?v1) (pred_1 ?v3)
               (pred_5 ?v1) (pred_9 ?v1 ?v3) (pred_7 ?v3))
:effect (and (pred_5 ?v3) (not (pred_5 ?v1))))

(:action op_4
:parameters (?v1 ?v7)
:precondition (and (pred_1 ?v1) (pred_12 ?v7) 
                  (pred_5 ?v1) (pred_6 ?v7 ?v1) (pred_4 ))
:effect (and (pred_2 ?v7)
   (not (pred_6 ?v7 ?v1)) (not (pred_4 ))))


(:action op_1
:parameters (?v1 ?v4 ?v6)
:precondition (and (pred_1 ?v1) (pred_12 ?v4) (pred_12 ?v6)
                  (pred_5 ?v1) (pred_2 ?v6) (pred_6 ?v4 ?v1))
:effect (and (pred_2 ?v4) (pred_6 ?v6 ?v1)
        (not (pred_2 ?v6)) (not (pred_6 ?v4 ?v1))))

(:action op_5
:parameters (?v1 ?v7)
:precondition (and (pred_1 ?v1) (pred_12 ?v7) 
                  (pred_5 ?v1) (pred_2 ?v7))
:effect (and (pred_4 ) (pred_6 ?v7 ?v1) (not (pred_2 ?v7)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_05 obj_11 obj_23 obj_06 obj_30 obj_14 obj_10 obj_29 obj_13 obj_16 obj_15 obj_09 obj_19 obj_24 obj_03 obj_22 obj_25 obj_01 obj_08 obj_21 obj_20 obj_27 obj_18 obj_17
    obj_07 obj_02
    obj_26 obj_28 obj_04
    )

    (:init
       (pred_4)

       (pred_1 obj_12)
       (pred_1 obj_05)
       (pred_1 obj_11)
       (pred_1 obj_23)
       (pred_1 obj_06)
       (pred_1 obj_30)
       (pred_1 obj_14)
       (pred_1 obj_10)
       (pred_1 obj_29)
       (pred_1 obj_13)
       (pred_1 obj_16)
       (pred_1 obj_15)
       (pred_1 obj_09)
       (pred_1 obj_19)
       (pred_1 obj_24)
       (pred_1 obj_03)
       (pred_1 obj_22)
       (pred_1 obj_25)
       (pred_1 obj_01)
       (pred_1 obj_08)
       (pred_1 obj_21)
       (pred_1 obj_20)
       (pred_1 obj_27)
       (pred_1 obj_18)
       (pred_1 obj_17)
       (pred_8 obj_07)
       (pred_8 obj_02)
       (pred_12 obj_26)
       (pred_12 obj_28)
       (pred_12 obj_04)

       (pred_9 obj_12 obj_30)
       (pred_9 obj_12 obj_05)
       (pred_9 obj_05 obj_14)
       (pred_9 obj_05 obj_11)
       (pred_9 obj_05 obj_12)
       (pred_9 obj_11 obj_10)
       (pred_9 obj_11 obj_23)
       (pred_9 obj_11 obj_05)
       (pred_9 obj_23 obj_29)
       (pred_9 obj_23 obj_06)
       (pred_9 obj_23 obj_11)
       (pred_9 obj_06 obj_13)
       (pred_9 obj_06 obj_23)
       (pred_9 obj_30 obj_16)
       (pred_9 obj_30 obj_14)
       (pred_9 obj_30 obj_12)
       (pred_9 obj_14 obj_15)
       (pred_9 obj_14 obj_10)
       (pred_9 obj_14 obj_05)
       (pred_9 obj_14 obj_30)
       (pred_9 obj_10 obj_09)
       (pred_9 obj_10 obj_29)
       (pred_9 obj_10 obj_11)
       (pred_9 obj_10 obj_14)
       (pred_9 obj_29 obj_19)
       (pred_9 obj_29 obj_13)
       (pred_9 obj_29 obj_23)
       (pred_9 obj_29 obj_10)
       (pred_9 obj_13 obj_24)
       (pred_9 obj_13 obj_06)
       (pred_9 obj_13 obj_29)
       (pred_9 obj_16 obj_03)
       (pred_9 obj_16 obj_15)
       (pred_9 obj_16 obj_30)
       (pred_9 obj_15 obj_22)
       (pred_9 obj_15 obj_09)
       (pred_9 obj_15 obj_14)
       (pred_9 obj_15 obj_16)
       (pred_9 obj_09 obj_25)
       (pred_9 obj_09 obj_19)
       (pred_9 obj_09 obj_10)
       (pred_9 obj_09 obj_15)
       (pred_9 obj_19 obj_01)
       (pred_9 obj_19 obj_24)
       (pred_9 obj_19 obj_29)
       (pred_9 obj_19 obj_09)
       (pred_9 obj_24 obj_08)
       (pred_9 obj_24 obj_13)
       (pred_9 obj_24 obj_19)
       (pred_9 obj_03 obj_21)
       (pred_9 obj_03 obj_22)
       (pred_9 obj_03 obj_16)
       (pred_9 obj_22 obj_20)
       (pred_9 obj_22 obj_25)
       (pred_9 obj_22 obj_15)
       (pred_9 obj_22 obj_03)
       (pred_9 obj_25 obj_27)
       (pred_9 obj_25 obj_01)
       (pred_9 obj_25 obj_09)
       (pred_9 obj_25 obj_22)
       (pred_9 obj_01 obj_18)
       (pred_9 obj_01 obj_08)
       (pred_9 obj_01 obj_19)
       (pred_9 obj_01 obj_25)
       (pred_9 obj_08 obj_17)
       (pred_9 obj_08 obj_24)
       (pred_9 obj_08 obj_01)
       (pred_9 obj_21 obj_20)
       (pred_9 obj_21 obj_03)
       (pred_9 obj_20 obj_27)
       (pred_9 obj_20 obj_22)
       (pred_9 obj_20 obj_21)
       (pred_9 obj_27 obj_18)
       (pred_9 obj_27 obj_25)
       (pred_9 obj_27 obj_20)
       (pred_9 obj_18 obj_17)
       (pred_9 obj_18 obj_01)
       (pred_9 obj_18 obj_27)
       (pred_9 obj_17 obj_08)
       (pred_9 obj_17 obj_18)
       (pred_3 obj_20)
       (pred_3 obj_16)
       (pred_3 obj_13)
       (pred_11  obj_20 obj_07)
       (pred_11  obj_16 obj_02)
       (pred_11  obj_13 obj_02)
       (pred_7 obj_12)
       (pred_7 obj_05)
       (pred_7 obj_11)
       (pred_7 obj_23)
       (pred_7 obj_06)
       (pred_7 obj_30)
       (pred_7 obj_14)
       (pred_7 obj_10)
       (pred_7 obj_29)
       (pred_7 obj_15)
       (pred_7 obj_09)
       (pred_7 obj_19)
       (pred_7 obj_24)
       (pred_7 obj_03)
       (pred_7 obj_22)
       (pred_7 obj_25)
       (pred_7 obj_01)
       (pred_7 obj_08)
       (pred_7 obj_21)
       (pred_7 obj_27)
       (pred_7 obj_18)
       (pred_7 obj_17)

       (pred_10  obj_26 obj_07)
       (pred_10  obj_28 obj_02)
       (pred_10  obj_04 obj_07)
       (pred_6 obj_26 obj_01)
       (pred_6 obj_28 obj_01)
       (pred_6 obj_04 obj_09)
       (pred_5 obj_14)
    )

    (:goal (and
       (pred_6 obj_26 obj_20)
       (pred_6 obj_28 obj_21)
    ))
(:constraints
  (always (not (pred_5 obj_25)))
)
)

; plan
1. (op_3 obj_14 obj_15)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_15)
   goals met: 0 of 2
2. (op_3 obj_15 obj_09)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_09)
   goals met: 0 of 2
3. (op_3 obj_09 obj_19)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_19)
   goals met: 0 of 2
4. (op_3 obj_19 obj_01)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_01)
   goals met: 0 of 2
5. (op_4 obj_01 obj_26)
   deleted: (pred_6 obj_26 obj_01) (pred_4)
   added: (pred_2 obj_26)
   goals met: 0 of 2
6. (op_3 obj_01 obj_18)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_18)
   goals met: 0 of 2
7. (op_3 obj_18 obj_27)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_27)
   goals met: 0 of 2
8. (op_2 obj_27 obj_20 obj_26 obj_07)
   deleted: (pred_3 obj_20)
   added: (pred_7 obj_20)
   goals met: 0 of 2
9. (op_3 obj_27 obj_20)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_20)
   goals met: 0 of 2
10. (op_5 obj_20 obj_26)
   deleted: (pred_2 obj_26)
   added: (pred_4) (pred_6 obj_26 obj_20)
   goals met: 1 of 2
11. (op_3 obj_20 obj_27)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_27)
   goals met: 1 of 2
12. (op_3 obj_27 obj_18)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_18)
   goals met: 1 of 2
13. (op_3 obj_18 obj_01)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_01)
   goals met: 1 of 2
14. (op_4 obj_01 obj_28)
   deleted: (pred_6 obj_28 obj_01) (pred_4)
   added: (pred_2 obj_28)
   goals met: 1 of 2
15. (op_3 obj_01 obj_18)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_18)
   goals met: 1 of 2
16. (op_3 obj_18 obj_27)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_27)
   goals met: 1 of 2
17. (op_3 obj_27 obj_20)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_20)
   goals met: 1 of 2
18. (op_3 obj_20 obj_21)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_21)
   goals met: 1 of 2
19. (op_5 obj_21 obj_28)
   deleted: (pred_2 obj_28)
   added: (pred_4) (pred_6 obj_28 obj_21)
   goals met: 2 of 2
